<?php
//    $array = [
//        [
//            'date' => '2015/8/17',
//            'sn' => '150814-008',
//            'type' => '来氟米特片',
//            'spec' => '10mg*16s'
//        ],
//        [
//            'date' => '2015/8/11',
//            'sn' => '150807-006',
//            'type' => '沙利度胺胶囊',
//            'spec' => '25mg*48s 120盒/箱'
//        ],
//        [
//            'date' => '2015/8/11',
//            'sn' => '150807-006',
//            'type' => '沙利度胺胶囊',
//            'spec' => '25mg*48s 120盒/箱'
//        ],
//        [
//            'date' => '2015/8/31',
//            'sn' => '150826-004',
//            'type' => '来氟米特片',
//            'spec' => '10mg*16s'
//        ],
//        [
//            'date' => '2015/8/31',
//            'sn' => '150826-005',
//            'type' => '来氟米特片',
//            'spec' => '10mg*16s'
//        ],
//        [
//            'date' => '2015/8/31',
//            'sn' => '150826-005',
//            'type' => '来氟米特片',
//            'spec' => '10mg*16s'
//        ],
//        [
//            'date' => '2015/8/6',
//            'sn' => '150803-004',
//            'type' => '沙利度胺胶囊',
//            'spec' => '25mg*48s 120盒/箱'
//        ],
//    ];
//
//    $res = [];
//
//    foreach ($array as $item => $value) {
//        if (isset($res[$value])) {
//
//        }
//    }
//
//    echo '<pre>';
//    print_r(array_values($res));
//    echo '</pre>';

//$a = 1;
////$b = 2;
////list($b, $a) = array($a, $b);
////
////echo $a.'<br>'.$b;

http://www.zhihu.com
?>